Обработки/Reports/_СЧА_ЦелевойКапитал.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_СЧА_ЦелевойКапитал</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_СЧА_ЦелевойКапитал/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Стоимость чистых активов Целевых капиталов ",
		"0.07",
		"",
		Истина);
		
	// команды
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Функция ПолучитьДоступныеНастройки() Экспорт

	Настройки = Новый Массив;
	Настройки.Добавить("ВариантОпределенияНачальнойДаты");
	Настройки.Добавить("Подписант");
	Настройки.Добавить("ПутьКФайлу");
	Настройки.Добавить("СрокПредоставления");

	Возврат Настройки;

КонецФункции

Функция ПолучитьПараметрыШапки()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент
		|ПОМЕСТИТЬ _КлиентДоверительногоУправления
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыЮридическихЛицОрганизации.ПолноеНаименованиеПоУставу КАК ДоверительныйУправляющий,
		|	СчетаДоверительногоУправления.НомерДоговора КАК НомерДоговора,
		|	СчетаДоверительногоУправления.ДатаЗаключения КАК ДатаДоговора,
		|	&Период КАК ДатаОтчета,
		|	ЕСТЬNULL(РеквизитыЮридическихЛицКлиента.ПолноеНаименованиеПоУставу, РеквизитыФизическихЛицКлиента.Фамилия + "" "" + ПОДСТРОКА(РеквизитыФизическихЛицКлиента.Имя, 1, 1) + "". "" + ПОДСТРОКА(РеквизитыФизическихЛицКлиента.Отчество, 1, 1) + ""."") КАК УчредительУправления,
		|	РеквизитыЮридическихЛицОрганизации.ИНН КАК ИННОрганизации,
		|	РеквизитыЮридическихЛицОрганизации.КПП КАК КППОрганизации,
		|	ЕСТЬNULL(РеквизитыЮридическихЛицКлиента.ИНН, РеквизитыФизическихЛицКлиента.ИНН) КАК ИННКлиента,
		|	ЕСТЬNULL(РеквизитыЮридическихЛицКлиента.КПП, """") КАК КППКлиента
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|			&Период,
		|			ЮрФизЛицо = &ЮрФизЛицо
		|				И Организация = &Организация
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицОрганизации,
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления,
		|	_КлиентДоверительногоУправления КАК _КлиентДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицКлиента
		|		ПО _КлиентДоверительногоУправления.Клиент = РеквизитыФизическихЛицКлиента.ЮрФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицКлиента
		|		ПО _КлиентДоверительногоУправления.Клиент = РеквизитыЮридическихЛицКлиента.ЮрФизЛицо
		|ГДЕ
		|	СчетаДоверительногоУправления.Ссылка = &СчетДоверительногоУправления";
	
	Запрос.УстановитьПараметр("Период", ЭтотОбъект.Период);
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ЮрФизЛицо", ЭтотОбъект.Организация.ЮрФизЛицо);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка;
	КонецЕсли;
		
КонецФункции

Процедура СформироватьОтчет(ДокументРезультат, ДокументРасшифровка = Неопределено)	Экспорт
	
	ДокументРезультат.Очистить();
	Если ДокументРасшифровка <> Неопределено Тогда 
		ДокументРасшифровка.Очистить();
	КонецЕсли;	
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ВидДоговораДоверительногоУправления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.СчетДоверительногоУправления, "ВидДоговораДоверительногоУправления");
	Если Не ВидДоговораДоверительногоУправления = Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЦелевыхКапиталов Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отчет предназначен только для счетов ДУ с видом 'Управление активами Целевых капиталов'");
		Возврат;
	КонецЕсли;
				
	СтруктураДанныхГлБухгалтера = Неопределено;
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхГлБухгалтера", СтруктураДанныхГлБухгалтера);
				
	Если Не ЗначениеЗаполнено(СтруктураДанныхГлБухгалтера) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран главный бухгалтер");
		Возврат;
	ИначеЕсли Не ЗначениеЗаполнено(СтруктураДанныхГлБухгалтера.КонтактноеЛицо) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран главный бухгалтер");
		Возврат;
	КонецЕсли;

	ТекДатаОкончания 	= НачалоДня(ЭтотОбъект.Период);
	ДатаСЧАНаКонецПериода = РегистрыСведений.НастройкиФормированияСЧА.ПолучитьБлижайшуюДатуФормированияСЧА(ЭтотОбъект.Организация, ЭтотОбъект.СчетДоверительногоУправления, ТекДатаОкончания);

	Если ДатаСЧАНаКонецПериода = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отчет не сформирован");	
		Возврат;
	КонецЕсли; 	
	
	// Фиксируем старт операции
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,СчетДоверительногоУправления");
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".ПриКомпоновкеРезультата()";
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);

	Макет = ПолучитьМакет("Макет");
	ОбластьОтчет = Макет.ПолучитьОбласть("Отчет");
	
	ДанныеШапки = ПолучитьПараметрыШапки();
	ЗаполнитьЗначенияСвойств(ОбластьОтчет.Параметры, ДанныеШапки);
	ОбластьОтчет.Параметры.ДатаОтчета = Формат(ЭтотОбъект.Период, "ДФ=dd/MM/yyyy");
	ОбластьОтчет.Параметры.ДатаСоставления = ТекущаяДатаСеанса();
	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	#ОБЛАСТЬ ТЕКСТ_ЗАПРОСА
	Запрос.Текст = 	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтоимостьПереоценки.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ВЫБОР
	|		КОГДА СтоимостьПереоценки.ЦеннаяБумага ССЫЛКА Справочник.Облигации
	|			ТОГДА ВЫБОР
	|					КОГДА Облигации.Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Государственная)
	|						ТОГДА ""Строка031""
	|					КОГДА Облигации.Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Субфедеральная)
	|						ТОГДА ""Строка032""
	|					КОГДА Облигации.Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Муниципальная)
	|						ТОГДА ""Строка033""
	|					КОГДА Облигации.Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Корпоративная)
	|						ТОГДА ""Строка034""
	|					КОГДА Облигации.Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Ипотечная)
	|						ТОГДА ""Строка038""
	|					КОГДА Облигации.Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Еврооблигация)
	|						ТОГДА ""Строка039""
	|				КОНЕЦ
	|		КОГДА СтоимостьПереоценки.ЦеннаяБумага ССЫЛКА Справочник.Акции
	|			ТОГДА ""Строка035""
	|		КОГДА СтоимостьПереоценки.ЦеннаяБумага ССЫЛКА Справочник.Паи
	|			ТОГДА ""Строка036""
	|		КОГДА СтоимостьПереоценки.ЦеннаяБумага ССЫЛКА Справочник.ИпотечныеСертификатыУчастия
	|			ТОГДА ""Строка038""
	|	КОНЕЦ КАК НомерСтроки,
	|	СтоимостьПереоценки.Цена КАК Стоимость,
	|	СУММА(СтоимостьПереоценки.СуммаВВалютеУчета) КАК Сумма,
	|	СУММА(СтоимостьПереоценки.СуммаКупонаВВалютеУчета) КАК Купон,
	|	СУММА(СтоимостьПереоценки.Количество) КАК Количество,
	|	СУММА(СтоимостьПереоценки.СуммаКупонаВВалютеУчета + СтоимостьПереоценки.СуммаВВалютеУчета) КАК ИтогоРынок
	|ПОМЕСТИТЬ _ТаблицаЦБ
	|ИЗ
	|	РегистрСведений.СтоимостьПереоценки КАК СтоимостьПереоценки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Облигации КАК Облигации
	|		ПО СтоимостьПереоценки.ЦеннаяБумага = Облигации.Ссылка
	|ГДЕ
	|	СтоимостьПереоценки.Период = &ДатаСЧАНаКонецПериода
	|	И СтоимостьПереоценки.Организация = &Организация
	|	И СтоимостьПереоценки.СчетДоверительногоУправления = &СчетДоверительногоУправления
	|	И СтоимостьПереоценки.ВидУчета = &ВидУчета
	|	И СтоимостьПереоценки.ЦельРасчета = ЗНАЧЕНИЕ(Справочник.ЦелиРасчета.ОценкаОбъектовВУправлении)
	|	И СтоимостьПереоценки.ВидЦеныОценки = ЗНАЧЕНИЕ(Перечисление.ВидыЦенОценки.ЦенаОценки)
	|
	|СГРУППИРОВАТЬ ПО
	|	СтоимостьПереоценки.ЦеннаяБумага,
	|	ВЫБОР
	|		КОГДА СтоимостьПереоценки.ЦеннаяБумага ССЫЛКА Справочник.Облигации
	|			ТОГДА ВЫБОР
	|					КОГДА Облигации.Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Государственная)
	|						ТОГДА ""Строка031""
	|					КОГДА Облигации.Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Субфедеральная)
	|						ТОГДА ""Строка032""
	|					КОГДА Облигации.Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Муниципальная)
	|						ТОГДА ""Строка033""
	|					КОГДА Облигации.Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Корпоративная)
	|						ТОГДА ""Строка034""
	|					КОГДА Облигации.Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Ипотечная)
	|						ТОГДА ""Строка038""
	|					КОГДА Облигации.Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Еврооблигация)
	|						ТОГДА ""Строка039""
	|				КОНЕЦ
	|		КОГДА СтоимостьПереоценки.ЦеннаяБумага ССЫЛКА Справочник.Акции
	|			ТОГДА ""Строка035""
	|		КОГДА СтоимостьПереоценки.ЦеннаяБумага ССЫЛКА Справочник.Паи
	|			ТОГДА ""Строка036""
	|		КОГДА СтоимостьПереоценки.ЦеннаяБумага ССЫЛКА Справочник.ИпотечныеСертификатыУчастия
	|			ТОГДА ""Строка038""
	|	КОНЕЦ,
	|	СтоимостьПереоценки.Цена
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива КАК ВидАктива,
	|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности КАК ВидЗадолженности,
	|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики КАК СубъектАналитики,
	|	СУММА(ВЫБОР
	|			КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)
	|				ТОГДА -СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СуммаРынокВВалютеУчета
	|			ИНАЧЕ СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СуммаРынокВВалютеУчета
	|		КОНЕЦ) КАК Сумма,
	|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Валюта КАК Валюта,
	|	ВЫБОР
	|		КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
	|			ТОГДА ""Строка010""
	|		КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДепозитныеВклады)
	|			ТОГДА ""Строка020""
	|		КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
	|			ТОГДА ВЫБОР
	|					КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности = НЕОПРЕДЕЛЕНО
	|							И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики ССЫЛКА Справочник.БрокерскиеКомпании
	|						ТОГДА ""Строка041""
	|					КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПогашениюКупона)
	|							ИЛИ СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПоследнемуПогашениюКупона)
	|						ТОГДА ""Строка042""
	|					ИНАЧЕ ""Строка043""
	|				КОНЕЦ
	|		КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)
	|			ТОГДА ВЫБОР
	|					КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.РасходыПоВознаграждениюСпецдепозитария)
	|						ТОГДА ""Строка071""
	|					КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВознаграждениюУправляющего)
	|						ТОГДА ""Строка072""
	|					ИНАЧЕ ""Строка073""
	|				КОНЕЦ
	|		КОГДА СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ПрочиеАктивы)
	|			ТОГДА ""Строка050""
	|	КОНЕЦ КАК НомерСтроки
	|ПОМЕСТИТЬ _АктивыНеЦБ
	|ИЗ
	|	РегистрСведений.СтоимостьАктивовНеОтносящихсяКЦеннымБумагам КАК СтоимостьАктивовНеОтносящихсяКЦеннымБумагам
	|ГДЕ
	|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Организация = &Организация
	|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СчетДоверительногоУправления = &СчетДоверительногоУправления
	|	И СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Период = &ДатаСЧАНаКонецПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидАктива,
	|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.ВидЗадолженности,
	|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.Валюта,
	|	СтоимостьАктивовНеОтносящихсяКЦеннымБумагам.СубъектАналитики
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ТаблицаЦБ.НомерСтроки КАК НомерСтроки,
	|	СУММА(_ТаблицаЦБ.ИтогоРынок) КАК Сумма
	|ПОМЕСТИТЬ _Показатели
	|ИЗ
	|	_ТаблицаЦБ КАК _ТаблицаЦБ
	|
	|СГРУППИРОВАТЬ ПО
	|	_ТаблицаЦБ.НомерСтроки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Строка030"",
	|	СУММА(_ТаблицаЦБ.ИтогоРынок)
	|ИЗ
	|	_ТаблицаЦБ КАК _ТаблицаЦБ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	_АктивыНеЦБ.НомерСтроки,
	|	СУММА(_АктивыНеЦБ.Сумма)
	|ИЗ
	|	_АктивыНеЦБ КАК _АктивыНеЦБ
	|
	|СГРУППИРОВАТЬ ПО
	|	_АктивыНеЦБ.НомерСтроки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Строка040"",
	|	СУММА(_АктивыНеЦБ.Сумма)
	|ИЗ
	|	_АктивыНеЦБ КАК _АктивыНеЦБ
	|ГДЕ
	|	_АктивыНеЦБ.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Строка070"",
	|	СУММА(_АктивыНеЦБ.Сумма)
	|ИЗ
	|	_АктивыНеЦБ КАК _АктивыНеЦБ
	|ГДЕ
	|	_АктивыНеЦБ.ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	""Строка060"" КАК НомерСтроки,
	|	СУММА(_Показатели.Сумма) КАК Сумма,
	|	1 КАК Знак
	|ПОМЕСТИТЬ _Итоги
	|ИЗ
	|	_Показатели КАК _Показатели
	|ГДЕ
	|	_Показатели.НомерСтроки В (""Строка010"", ""Строка020"", ""Строка030"", ""Строка040"", ""Строка050"")
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Строка080"",
	|	СУММА(_Показатели.Сумма),
	|	-1
	|ИЗ
	|	_Показатели КАК _Показатели
	|ГДЕ
	|	_Показатели.НомерСтроки В (""Строка070"")
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА БухгалтерскийУчетОстатки.Счет В (ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Основной.ВалютныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Основной.ДенежныеСредстваУБрокера), ЗНАЧЕНИЕ(ПланСчетов.Основной.ВалютныеСредстваУБрокера))
	|			ТОГДА ""Строка010""
	|		КОГДА БухгалтерскийУчетОстатки.Счет В (ЗНАЧЕНИЕ(ПланСчетов.Основной.ДепозитныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Основной.ДепозитныеСчетаИСертификаты))
	|			ТОГДА ""Строка020""
	|		КОГДА БухгалтерскийУчетОстатки.Счет В (ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыЧерезБрокера), ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыЧерезБрокераВВалюте))
	|			ТОГДА ""Строка041""
	|		КОГДА БухгалтерскийУчетОстатки.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Основной.КупонУплаченныйПриПокупке), ЗНАЧЕНИЕ(ПланСчетов.Основной.ПереоценкаЦенныхБумаг), ЗНАЧЕНИЕ(ПланСчетов.Основной.ПогашениеКупона), ЗНАЧЕНИЕ(ПланСчетов.Основной.ПогашениеКупонаЕврооблигации))
	|			ТОГДА ""Строка042""
	|		КОГДА БухгалтерскийУчетОстатки.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Основной.КупонУплаченныйПриПокупке), ЗНАЧЕНИЕ(ПланСчетов.Основной.ПереоценкаЦенныхБумаг), ЗНАЧЕНИЕ(ПланСчетов.Основной.ПогашениеКупона), ЗНАЧЕНИЕ(ПланСчетов.Основной.ПогашениеКупонаЕврооблигации))
	|			ТОГДА ""Строка042""
	|		КОГДА БухгалтерскийУчетОстатки.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Основной.РезервыПоСомнительнымДолгам))
	|			ТОГДА ""Строка043""
	|		КОГДА БухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.УслугиДепозитария)
	|			ТОГДА ""Строка071""
	|		КОГДА БухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыПоВознаграждениюУК)
	|			ТОГДА ""Строка072""
	|		КОГДА БухгалтерскийУчетОстатки.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыСПоставщиками), ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыСПрочимиДебиторамиИКредиторами))
	|				И БухгалтерскийУчетОстатки.СуммаОстатокДт > 0
	|			ТОГДА ""Строка043""
	|		КОГДА БухгалтерскийУчетОстатки.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыСПоставщиками), ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыСПрочимиДебиторамиИКредиторами))
	|				И БухгалтерскийУчетОстатки.СуммаОстатокКт > 0
	|			ТОГДА ""Строка073""
	|		КОГДА БухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПредоставленныеЗаймы)
	|			ТОГДА ""Строка043""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК НомерСтроки,
	|	БухгалтерскийУчетОстатки.Счет КАК Счет,
	|	ВЫБОР
	|		КОГДА БухгалтерскийУчетОстатки.Счет В (ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Основной.ВалютныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Основной.ДенежныеСредстваУБрокера), ЗНАЧЕНИЕ(ПланСчетов.Основной.ВалютныеСредстваУБрокера))
	|			ТОГДА БухгалтерскийУчетОстатки.СуммаОстатокДт
	|		КОГДА БухгалтерскийУчетОстатки.Счет В (ЗНАЧЕНИЕ(ПланСчетов.Основной.ДепозитныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Основной.ДепозитныеСчетаИСертификаты))
	|			ТОГДА БухгалтерскийУчетОстатки.СуммаОстатокДт
	|		КОГДА БухгалтерскийУчетОстатки.Счет В (ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыЧерезБрокера), ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыЧерезБрокераВВалюте))
	|			ТОГДА БухгалтерскийУчетОстатки.СуммаОстатокДт
	|		КОГДА БухгалтерскийУчетОстатки.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Основной.КупонУплаченныйПриПокупке), ЗНАЧЕНИЕ(ПланСчетов.Основной.ПереоценкаЦенныхБумаг), ЗНАЧЕНИЕ(ПланСчетов.Основной.ПогашениеКупона), ЗНАЧЕНИЕ(ПланСчетов.Основной.ПогашениеКупонаЕврооблигации))
	|			ТОГДА БухгалтерскийУчетОстатки.СуммаОстатокДт
	|		КОГДА БухгалтерскийУчетОстатки.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Основной.КупонУплаченныйПриПокупке), ЗНАЧЕНИЕ(ПланСчетов.Основной.ПереоценкаЦенныхБумаг), ЗНАЧЕНИЕ(ПланСчетов.Основной.ПогашениеКупона), ЗНАЧЕНИЕ(ПланСчетов.Основной.ПогашениеКупонаЕврооблигации))
	|			ТОГДА БухгалтерскийУчетОстатки.СуммаОстатокДт
	|		КОГДА БухгалтерскийУчетОстатки.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Основной.РезервыПоСомнительнымДолгам))
	|			ТОГДА -БухгалтерскийУчетОстатки.СуммаОстатокКт
	|		КОГДА БухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.УслугиДепозитария)
	|			ТОГДА БухгалтерскийУчетОстатки.СуммаОстатокКт
	|		КОГДА БухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыПоВознаграждениюУК)
	|			ТОГДА БухгалтерскийУчетОстатки.СуммаОстатокКт
	|		КОГДА БухгалтерскийУчетОстатки.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыСПоставщиками), ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыСПрочимиДебиторамиИКредиторами))
	|				И БухгалтерскийУчетОстатки.СуммаОстатокДт > 0
	|			ТОГДА БухгалтерскийУчетОстатки.СуммаОстатокДт
	|		КОГДА БухгалтерскийУчетОстатки.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыСПоставщиками), ЗНАЧЕНИЕ(ПланСчетов.Основной.РасчетыСПрочимиДебиторамиИКредиторами))
	|				И БухгалтерскийУчетОстатки.СуммаОстатокКт > 0
	|			ТОГДА БухгалтерскийУчетОстатки.СуммаОстатокКт
	|		КОГДА БухгалтерскийУчетОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПредоставленныеЗаймы)
	|			ТОГДА БухгалтерскийУчетОстатки.СуммаОстатокДт
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Сумма
	|ПОМЕСТИТЬ _ДбКтПредварительный
	|ИЗ
	|	РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
	|			&ДатаОкончания_Граница,
	|			,
	|			,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК БухгалтерскийУчетОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ДбКтПредварительный.НомерСтроки КАК НомерСтроки,
	|	_ДбКтПредварительный.Счет КАК Счет,
	|	СУММА(_ДбКтПредварительный.Сумма) КАК Сумма,
	|	ВЫБОР
	|		КОГДА _ДбКтПредварительный.НомерСтроки = ""Строка010""
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)
	|		КОГДА _ДбКтПредварительный.НомерСтроки = ""Строка020""
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДепозитныеВклады)
	|		КОГДА _ДбКтПредварительный.НомерСтроки В (""Строка041"", ""Строка042"", ""Строка043"")
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДебиторскаяЗадолженность)
	|		КОГДА _ДбКтПредварительный.НомерСтроки В (""Строка071"", ""Строка072"", ""Строка073"")
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.КредиторскаяЗадолженность)
	|	КОНЕЦ КАК ВидАктива
	|ПОМЕСТИТЬ _АктивыНеЦБ_Бух
	|ИЗ
	|	_ДбКтПредварительный КАК _ДбКтПредварительный
	|ГДЕ
	|	_ДбКтПредварительный.Сумма > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	_ДбКтПредварительный.НомерСтроки,
	|	_ДбКтПредварительный.Счет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	БухПартииЦенныхБумагОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
	|	БухПартииЦенныхБумагОстатки.СтоимостьВВалютеУчетаОстаток КАК БалансоваяСтоимостьБезНКД,
	|	БухПартииЦенныхБумагОстатки.ПереоценкаВВалютеУчетаОстаток + БухПартииЦенныхБумагОстатки.ИндексацияНоминалаОстаток КАК Переоценка,
	|	БухПартииЦенныхБумагОстатки.СтоимостьКупонаВВалютеУчетаОстаток + БухПартииЦенныхБумагОстатки.ПереоценкаКупонаВВалютеУчетаОстаток КАК НКДУплаченныйНачисленный,
	|	БухПартииЦенныхБумагОстатки.СуммаРезервовПодОбесценениеОстаток КАК СуммаРезервовПодОбесценение
	|ПОМЕСТИТЬ _ЦенныеБумагиСПартиями
	|ИЗ
	|	РегистрНакопления.БухПартииЦенныхБумаг.Остатки(
	|			&ДатаОкончания_Граница,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	|				И ВидУчета = &ВидУчета
	|				И Рынок В (ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия))) КАК БухПартииЦенныхБумагОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	БухПартииЦенныхБумагКПолучениюОстатки.ЦеннаяБумага,
	|	0,
	|	БухПартииЦенныхБумагКПолучениюОстатки.ПереоценкаНаБалансеОстаток,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.БухПартииЦенныхБумагКПолучению.Остатки(
	|			&ДатаОкончания_Граница,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	|				И ВидУчета = &ВидУчета
	|				И Рынок В (ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Акции), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Паи), ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.ИпотечныеСертификатыУчастия))) КАК БухПартииЦенныхБумагКПолучениюОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЦеннаяБумага
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
	|	СУММА(_ЦенныеБумаги.БалансоваяСтоимостьБезНКД) КАК БалансоваяСтоимостьБезНКД,
	|	СУММА(_ЦенныеБумаги.Переоценка) КАК Переоценка,
	|	СУММА(_ЦенныеБумаги.НКДУплаченныйНачисленный) КАК НКДУплаченныйНачисленный,
	|	СУММА(_ЦенныеБумаги.СуммаРезервовПодОбесценение) КАК СуммаРезервовПодОбесценение,
	|	СУММА(_ЦенныеБумаги.БалансоваяСтоимостьБезНКД + _ЦенныеБумаги.Переоценка + _ЦенныеБумаги.НКДУплаченныйНачисленный - _ЦенныеБумаги.СуммаРезервовПодОбесценение) КАК ИтогоБух
	|ПОМЕСТИТЬ _ТаблицаЦБ_Бух
	|ИЗ
	|	_ЦенныеБумагиСПартиями КАК _ЦенныеБумаги
	|
	|СГРУППИРОВАТЬ ПО
	|	_ЦенныеБумаги.ЦеннаяБумага
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ТаблицаЦБ.ЦеннаяБумага КАК ЦеннаяБумага,
	|	_ТаблицаЦБ.НомерСтроки КАК НомерСтроки,
	|	_ТаблицаЦБ.Стоимость КАК Стоимость,
	|	_ТаблицаЦБ.Сумма КАК Сумма,
	|	_ТаблицаЦБ.Купон КАК Купон,
	|	_ТаблицаЦБ.Количество КАК Количество,
	|	_ТаблицаЦБ.ИтогоРынок КАК ИтогоРынок,
	|	ЕСТЬNULL(_ТаблицаЦБ_Бух.БалансоваяСтоимостьБезНКД, 0) КАК БалансоваяСтоимостьБезНКД,
	|	ЕСТЬNULL(_ТаблицаЦБ_Бух.Переоценка, 0) КАК Переоценка,
	|	ЕСТЬNULL(_ТаблицаЦБ_Бух.НКДУплаченныйНачисленный, 0) КАК НКДУплаченныйНачисленный,
	|	ЕСТЬNULL(_ТаблицаЦБ_Бух.СуммаРезервовПодОбесценение, 0) КАК СуммаРезервовПодОбесценение,
	|	ЕСТЬNULL(_ТаблицаЦБ_Бух.ИтогоБух, 0) КАК ИтогоБух
	|ПОМЕСТИТЬ _ЦенныеБумаги
	|ИЗ
	|	_ТаблицаЦБ КАК _ТаблицаЦБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ _ТаблицаЦБ_Бух КАК _ТаблицаЦБ_Бух
	|		ПО _ТаблицаЦБ.ЦеннаяБумага = _ТаблицаЦБ_Бух.ЦеннаяБумага
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_Показатели.НомерСтроки КАК НомерСтроки,
	|	_Показатели.Сумма КАК Сумма
	|ИЗ
	|	_Показатели КАК _Показатели
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	_Итоги.НомерСтроки,
	|	_Итоги.Сумма
	|ИЗ
	|	_Итоги КАК _Итоги
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""Строка090"",
	|	СУММА(_Итоги.Сумма * _Итоги.Знак)
	|ИЗ
	|	_Итоги КАК _Итоги";
	
	#КОНЕЦОБЛАСТИ 
	
	Запрос.УстановитьПараметр("Организация", 					ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", 	ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ВидУчета",						Перечисления.ВидыУчета.БухгалтерскийУчет);
	Запрос.УстановитьПараметр("ЦельРасчета",					Справочники.ЦелиРасчета.ОценкаОбъектовВУправлении);	
	Запрос.УстановитьПараметр("ДатаСЧАНаКонецПериода", 			ДатаСЧАНаКонецПериода);
	Запрос.УстановитьПараметр("ДатаОкончания_Граница", 			Новый Граница(КонецДня(ЭтотОбъект.Период), ВидГраницы.Включая));
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Пока Выборка.Следующий() Цикл 
		ОбластьОтчет.Параметры[Выборка.НомерСтроки] = Выборка.Сумма; 
	КонецЦикла;	


	ОбластьОтчет.Параметры.ГлавныйБухгалтер 	= СтруктураДанныхГлБухгалтера.КонтактноеЛицо;
	ОбластьОтчет.Параметры.ДолжностьГлавбух    = СтруктураДанныхГлБухгалтера.Должность;
	ДокументРезультат.Вывести(ОбластьОтчет);
	
	ТаблицаЦБ = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_ЦенныеБумаги").ПолучитьДанные().Выгрузить();
	АктивыНеЦБ = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_АктивыНеЦБ").ПолучитьДанные().Выгрузить(); 
	АктивыНеЦБ_Бух = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_АктивыНеЦБ_Бух").ПолучитьДанные().Выгрузить(); 
	Если ДокументРасшифровка <> Неопределено Тогда  
		ЗаполнитьРасшифровку(ДокументРасшифровка, ТаблицаЦБ, АктивыНеЦБ, АктивыНеЦБ_Бух) ;
	КонецЕсли;	
		
	// Заполняем настройки печати	
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ДокументРезультат, ЭтотОбъект.Метаданные().ПолноеИмя());
	
	// Фиксируем завершение операции
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
		
КонецПроцедуры

Процедура ЗаполнитьРасшифровку(ДокументРасшифровка, ТаблицаЦБ, АктивыНеЦБ, АктивыНеЦБ_Бух)
	
	Макет = ПолучитьМакет("Расшифровка"); 
	
	ТаблицаЦБ.Сортировать("НомерСтроки, ЦеннаяБумага"); 
	АктивыНеЦБ.Сортировать("НомерСтроки"); 
	АктивыНеЦБ_Бух.Сортировать("НомерСтроки, Счет"); 
	
	
	ОбластьШапкаБЦ = Макет.ПолучитьОбласть("ШапкаЦБ");
	ОбластьСтрокаЦБ = Макет.ПолучитьОбласть("СтрокаЦБ");
	ОбластьШапкаНеБЦ = Макет.ПолучитьОбласть("ШапкаНеЦБ");
	ОбластьСтрокаНеЦБ = Макет.ПолучитьОбласть("СтрокаНеЦБ");
	ОбластьШапкаНеБЦ_Бух = Макет.ПолучитьОбласть("ШапкаНеЦБ_Бух");
	ОбластьСтрокаНеЦБ_Бух = Макет.ПолучитьОбласть("СтрокаНеЦБ_Бух");
	
	// ценные бумаги. На уровне запроса объединены данные СЧА и БУ.
	ДокументРасшифровка.Вывести(ОбластьШапкаБЦ);
	
	Для Каждого СтрокаТаблицаЦБ из ТаблицаЦБ Цикл 
		ЗаполнитьЗначенияСвойств(ОбластьСтрокаЦБ.Параметры, СтрокаТаблицаЦБ);
		ДокументРасшифровка.Вывести(ОбластьСтрокаЦБ);
	КонецЦикла;	
		
	// Активы не ЦБ. 
	ДокументРасшифровка.Вывести(ОбластьШапкаНеБЦ);
	Для Каждого СтрокаАктивыНеЦБ из АктивыНеЦБ Цикл 
		ЗаполнитьЗначенияСвойств(ОбластьСтрокаНеЦБ.Параметры, СтрокаАктивыНеЦБ);
		ДокументРасшифровка.Вывести(ОбластьСтрокаНеЦБ);
	КонецЦикла;	
	
	// Активы не ЦБ (бух) 
	ДокументРасшифровка.Вывести(ОбластьШапкаНеБЦ_Бух);
	Для Каждого СтрокаАктивыНеЦБ_Бух из АктивыНеЦБ_Бух Цикл 
		ЗаполнитьЗначенияСвойств(ОбластьСтрокаНеЦБ_Бух.Параметры, СтрокаАктивыНеЦБ_Бух);
		ДокументРасшифровка.Вывести(ОбластьСтрокаНеЦБ_Бух);
	КонецЦикла;	
	
	
КонецПроцедуры	

Процедура АвтоматическоеФормирование(НастройкиОтчета) Экспорт
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОтчета);
	
//	ЭтотОбъект.Подписант	= НастройкиОтчета.Подписант.КонтактноеЛицо;
	ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхГлБухгалтера",	НастройкиОтчета.Подписант);

	ЭтотОбъект.Период		= НастройкиОтчета.Период.ДатаОкончания;	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	СформироватьОтчет(ДокументРезультат);
	
	НастройкиОтчета.Вставить("Результат", ДокументРезультат);
	
КонецПроцедуры
